Repository: noxferatum/optoview-flutter
Catalog: lib/l10n/app_*.arb
Languages: es

# menuTitle
source: OptoViewApp - Menu
es: OptoViewApp - Menú

# menuStart
source: Start
es: Iniciar

# menuCredits
source: Credits
es: Créditos

# testMenuTitle
source: Choose an exercise
es: Elige un ejercicio

# testPeripheralTitle
source: Peripheral stimulation
es: Estimulación periférica

# testPeripheralSubtitle
source: Train dynamic peripheral perception.
es: Entrena la percepción periférica dinámica.

# testLocalizationTitle
source: Peripheral localization
es: Localización periférica

# testLocalizationSubtitle
source: Train peripheral localization.
es: Entrena la localización periférica.

# testComingSoonTitle
source: More coming soon
es: Próximamente más

# testComingSoonSubtitle
source: New evaluation protocols.
es: Nuevos protocolos de evaluación.

# testComingSoonSnackbar
source: We are working on more specialized tests.
es: Estamos trabajando en más tests especializados.

# configPeripheralTitle
source: Peripheral stimulation test
es: Test de estimulación periférica

# configLocalizationTitle
source: Peripheral localization test
es: Test de localización periférica

source: Start test
es: Iniciar prueba

# presetsHint
source: Select a preset or customize each option below.
es: Selecciona un preset o personaliza cada opción abajo.

# presetStandard
source: Standard
es: Estándar

# presetStandardDesc
source: Balanced configuration for general use
es: Configuración equilibrada para uso general

# presetEasy
source: Easy
es: Fácil

# presetEasyDesc
source: Large and slow stimuli, ideal for beginners
es: Estímulos grandes y lentos, ideal para inicio

# presetAdvanced
source: Advanced
es: Avanzado

# presetAdvancedDesc
source: Fast, small stimuli with distractors
es: Estímulos rápidos, pequeños y con distractores

# presetLocStandardDesc
source: Match center, medium speed
es: Igualar centro, velocidad media

# presetLocEasyDesc
source: Touch all, slow, with feedback
es: Tocar todos, lento, con feedback

# presetLocAdvancedDesc
source: Same shape, fast, no feedback, 3 stimuli
es: Misma forma, rápido, sin feedback, 3 estímulos

# sideTitle
source: Stimulation side
es: Lado de estimulación

# sideLeft
source: Left
es: Izquierda

# sideRight
source: Right
es: Derecha

# sideTop
source: Top
es: Arriba

# sideBottom
source: Bottom
es: Abajo

# sideBoth
source: Both
es: Ambos

# sideRandom
source: Random
es: Aleatorio

# sideDescLeft
source: Stimuli will appear only on the left side of the screen.
es: Los estímulos aparecerán únicamente en el lado izquierdo de la pantalla.

# sideDescRight
source: Stimuli will appear only on the right side of the screen.
es: Los estímulos aparecerán únicamente en el lado derecho de la pantalla.

# sideDescTop
source: Stimuli will appear only on the top.
es: Los estímulos aparecerán únicamente en la parte superior.

# sideDescBottom
source: Stimuli will appear only on the bottom.
es: Los estímulos aparecerán únicamente en la parte inferior.

# sideDescBoth
source: Stimuli can appear on both sides.
es: Los estímulos podrán aparecer en ambos lados.

# sideDescRandom
source: The stimuli appearance side will be random each cycle.
es: El lado de aparición de los estímulos será aleatorio en cada ciclo.

# symbolTitle
source: Stimulus type
es: Tipo de estímulo

# symbolLetters
source: Letters
es: Letras

# symbolNumbers
source: Numbers
es: Números

# symbolShapes
source: Shapes
es: Formas

# symbolFormTitle
source: Shape (optional)
es: Forma (opcional)

# symbolFormRandom
source: Random
es: Aleatoria

# formaCircle
source: Circle
es: Círculo

# formaSquare
source: Square
es: Cuadrado

# formaHeart
source: Heart
es: Corazón

# formaTriangle
source: Triangle
es: Triángulo

# formaClover
source: Clover
es: Trébol

# colorTitle
source: Stimulus color
es: Color del estímulo

# colorRed
source: Red
es: Rojo

# colorGreen
source: Green
es: Verde

# colorBlue
source: Blue
es: Azul

# colorYellow
source: Yellow
es: Amarillo

# colorWhite
source: White
es: Blanco

# colorPurple
source: Purple
es: Morado

# colorBlack
source: Black
es: Negro

# colorRandom
source: Random
es: Aleatorio

# speedTitle
source: Speed
es: Velocidad

# speedSlow
source: Slow
es: Lenta

# speedMedium
source: Medium
es: Media

# speedFast
source: Fast
es: Rápida

# movementTitle
source: Stimulus movement
es: Movimiento del estímulo

# movementFixed
source: Fixed
es: Fijo

# movementRandom
source: Random
es: Aleatorio

# movementDescFixed
source: The stimulus remains static in its position.
es: El estímulo permanece estático en su posición.

# movementDescHorizontal
source: The stimulus slides from left to right or vice versa.
es: El estímulo se desliza de izquierda a derecha o viceversa.

# movementDescVertical
source: The stimulus slides from top to bottom or vice versa.
es: El estímulo se desliza de arriba a abajo o viceversa.

# movementDescRandom
source: The stimulus randomly alternates between horizontal and vertical displacement.
es: El estímulo cambia aleatoriamente entre desplazamiento horizontal y vertical.

# distanceTitle
source: Distance to center
es: Distancia al centro

# distanceRandom
source: Random
es: Aleatoria

# distanceRandomSubtitle
source: Randomly changes the stimulus distance
es: Cambia aleatoriamente la distancia del estímulo

# distanceFixed
source: Fixed
es: Fija

# distanceCurrent
source: Current distance: {pct}%
es: Distancia actual: {pct}%

# durationTitle
source: Duration (seconds)
es: Duración (segundos)

# sizeTitle
source: Size (%)
es: Tamaño (%)

# sizeRandomToggle
source: Vary size randomly
es: Variar tamaño aleatoriamente

# sizeRandomSubtitle
source: When enabled, each stimulus will adjust its size around the configured value.
es: Si se activa, cada estímulo ajustará su tamaño alrededor del valor configurado.

# fixationTitle
source: Fixation point
es: Punto de fijación

# fixationFace
source: Face
es: Cara

# fixationEye
source: Eye
es: Ojo

# fixationDot
source: Dot
es: Punto

# fixationClover
source: Clover
es: Trébol

# fixationCross
source: Cross
es: Cruz

# backgroundTitle
source: Background & distractor
es: Fondo y distractor

# backgroundLight
source: Light
es: Claro

# backgroundDark
source: Dark
es: Oscuro

# backgroundBlue
source: Blue
es: Azul

# backgroundDistractor
source: Distractor background
es: Fondo distractor

# backgroundDistractorSubtitle
source: Adds a soft low-intensity pattern.
es: Añade un patrón suave de baja intensidad.

# backgroundAnimate
source: Animate distractor
es: Animar distractor

# backgroundAnimateSubtitle
source: Enables subtle pattern movement to increase visual difficulty.
es: Activa un movimiento leve del patrón para aumentar la dificultad visual.

# locModeTitle
source: Localization mode
es: Modo de localización

# locModeTouchAll
source: Touch all
es: Tocar todos

# locModeMatchCenter
source: Match center
es: Igualar centro

# locModeSameColor
source: Same color
es: Mismo color

# locModeSameShape
source: Same shape
es: Misma forma

# locModeTouchAllDesc
source: Touch all stimuli that appear
es: Toca todos los estímulos que aparezcan

# locModeMatchCenterDesc
source: Only touch those matching the center
es: Solo toca los que coincidan con el centro

# locModeSameColorDesc
source: Only touch those with the same color as the center
es: Solo toca los del mismo color que el centro

# locModeSameShapeDesc
source: Only touch those with the same shape as the center
es: Solo toca los de la misma forma que el centro

# locInteractionTitle
source: Interaction options
es: Opciones de interacción

# locCenterFixed
source: Fixed center
es: Centro fijo

# locCenterFixedOn
source: The central stimulus does not change during the test
es: El estímulo central no cambia durante la prueba

# locCenterFixedOff
source: The central stimulus changes each cycle
es: El estímulo central cambia cada ciclo

# locFeedback
source: Visual feedback
es: Feedback visual

# locFeedbackSubtitle
source: Show visual indication on touch (correct/error)
es: Mostrar indicación visual al tocar (acierto/error)

# locDisappearTitle
source: Stimulus disappearance
es: Desaparición del estímulo

# locDisappearByTime
source: By time
es: Por tiempo

# locDisappearWaitTouch
source: Wait for touch
es: Esperar toque

# locSimultaneousTitle
source: Simultaneous stimuli
es: Estímulos simultáneos

# testTimeRemaining
source: Time remaining: {seconds} s
es: Tiempo restante: {seconds} s

# testTimeAndHits
source: Time: {seconds} s | Correct: {hits}
es: Tiempo: {seconds} s | Aciertos: {hits}

# testPause
source: Pause
es: Pausar

# testResume
source: Resume
es: Reanudar

# testStop
source: Stop
es: Terminar

source: TEST PAUSED
es: PRUEBA EN PAUSA

# countdownReady
source: Get ready!
es: ¡Prepárate!

# resultsTitle
source: Test results
es: Resultados de la prueba

# resultsLocTitle
source: Results - Localization
es: Resultados - Localización

# resultsCompleted
source: Test completed
es: Prueba completada

# resultsStopped
source: Test stopped
es: Prueba detenida

# statsTitle
source: Statistics
es: Estadísticas

# statsActualDuration
source: Actual duration
es: Duración real

# statsConfigDuration
source: Configured duration
es: Duración configurada

# statsStimuliShown
source: Stimuli shown
es: Estímulos mostrados

# statsStimuliPerMinute
source: Stimuli/minute
es: Estímulos/minuto

# accuracyTitle
source: Accuracy
es: Precisión

# accuracyCorrect
source: Correct
es: Aciertos

# accuracyErrors
source: Errors
es: Errores

# accuracyMissed
source: Missed
es: Omisiones

# accuracyPercent
source: Accuracy %
es: % de acierto

# reactionTitle
source: Reaction time
es: Tiempo de reacción

# reactionAvg
source: Average
es: Promedio

# reactionBest
source: Best
es: Mejor

# reactionWorst
source: Worst
es: Peor

# configUsedTitle
source: Configuration used
es: Configuración usada

# resultsRepeat
source: Repeat test
es: Repetir prueba

# resultsHome
source: Back to menu
es: Volver al menú

# summaryKeySide
source: Side
es: Lado

# summaryKeyStimulus
source: Stimulus
es: Estímulo

# summaryKeySpeed
source: Speed
es: Velocidad

# summaryKeyMovement
source: Movement
es: Movimiento

# summaryKeyDistance
source: Distance
es: Distancia

# summaryKeySize
source: Size
es: Tamaño

# summaryKeyDuration
source: Duration
es: Duración

# summaryKeyFixation
source: Fixation
es: Fijación

# summaryKeyBackground
source: Background
es: Fondo

# summaryKeyMode
source: Mode
es: Modo

# summaryKeyCenter
source: Center
es: Centro

# summaryKeyDisappear
source: Disappearance
es: Desaparición

# summaryKeySimultaneous
source: Simultaneous stimuli
es: Estímulos simultáneos

# summaryDistRandom
source: Random
es: Aleatoria

# summarySizeRandom
source: ~{pct}% (random)
es: ~{pct}% (aleatorio)

# summaryDistractorAnimated
source: + Animated distractor
es: + Distractor animado

# summaryCenterFixed
source: Fixed
es: Fijo

# summaryCenterChanging
source: Changing
es: Cambiante

# summaryYes
source: Yes
es: Sí

# creditsTitle
source: Credits
es: Créditos

# creditsDescription
source: This application has been developed with the help of the licensed optometrist expert in visual therapy Estefanía Rodríguez-Bobada Lillo.
es: Esta aplicación ha sido desarrollada con la ayuda de la optometrista titulada experta en terapia visual Estefanía Rodríguez-Bobada Lillo.

# creditsCompany
source: Company
es: Empresa

# creditsYear
source: Year
es: Año

# creditsVersion
source: Version
es: Versión

# creditsBack
source: Back
es: Volver
